DataProcessors/атл_ПересчетВремениПереходаВСтатусПоЗадачамМобильнымСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ПересчетВремениПереходаВСтатусПоЗадачамМобильнымСотрудникам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаМобильномуСотруднику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.атл_ЗадачаМобильномуСотруднику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/атл_ПересчетВремениПереходаВСтатусПоЗадачамМобильнымСотрудникам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КнопкаВыбораПериода(Команда)
	
	ПеременнаяТипаСтандартныйПериод = Новый СтандартныйПериод; 

	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период.ДатаНачала = Объект.ДатаНачала; 
	Диалог.Период.ДатаОкончания = Объект.ДатаОкончания; 
	Если Диалог.Редактировать() Тогда 
		ПеременнаяТипаСтандартныйПериод = Диалог.Период;
		Объект.ДатаНачала = ПеременнаяТипаСтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = ПеременнаяТипаСтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьНаСервере()
	
	МассивИнтервалов = атл_УправлениеМобильнымиСотрудниками.ПолучитьМассивИнтервалов();

	Если ЗначениеЗаполнено(Объект.ЗадачаМобильномуСотруднику) Тогда
		
		Для Каждого Интервал из МассивИнтервалов Цикл
			атл_УправлениеМобильнымиСотрудниками.СформироватьЗаписьВРегистреатл_ЗатраченноеВремяПоИнтерваламПоЗадачамМобильнымСотрудникам(Объект.ЗадачаМобильномуСотруднику, Интервал);
		КонецЦикла;
		
	Иначе
		
		ВыборкаЗадач = Документы.атл_ЗадачаМобильномуСотруднику.Выбрать(Объект.ДатаНачала, ?(Объект.ДатаОкончания = Дата("00010101"), Дата("39991231"), КонецДня(Объект.ДатаОкончания)));
		
		Пока ВыборкаЗадач.Следующий() Цикл
			Для Каждого Интервал из МассивИнтервалов Цикл
				атл_УправлениеМобильнымиСотрудниками.СформироватьЗаписьВРегистреатл_ЗатраченноеВремяПоИнтерваламПоЗадачамМобильнымСотрудникам(ВыборкаЗадач.Ссылка, Интервал);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	КомандаВыполнитьНаСервере();
	
КонецПроцедуры
